IcyWindsReserveActionName="TestXG"
IcyWindsMarkEffectName="TestXG"


[KnightsCharge X2AbilityTemplate]
LocFriendlyName="Knight's Charge"
LocHelpText="An upgraded Shield Bash that costs 1 action and does not end the turn. Can be used with dashes. Disorrients."
LocLongDescription="An upgraded Shield Bash that costs 1 action and does not end the turn. Can be used with dashes. Disorrients."
LocPromotionPopupText="<Bullet/> An upgraded Shield Bash that costs 1 action and does not end the turn. Can be used with dashes. Disorrients."
LocFlyOverText="Knights Charge"

[KnightsForce X2AbilityTemplate]
LocFriendlyName="Knight's Force"
LocHelpText="A turn ending dashing attack with the shield that stuns for 2 actions."
LocLongDescription="A turn ending dashing attack with the shield that stuns for 2 actions."
LocPromotionPopupText="<Bullet/> A turn ending dashing attack with the shield that stuns for 2 actions. 3 Turn Cooldown."
LocFlyOverText="Knights Force"

[EagleEye X2AbilityTemplate]
LocFriendlyName="Eagle Eye"
LocHelpText="Passively increases sight radius by 5. Activate on cooldown to increase this radius by an additional 5."
LocLongDescription="Passively increases sight radius by 5. Activate on cooldown to increase this radius by an additional 5."
LocPromotionPopupText="<Bullet/> Passively increases sight radius by 5. Activate on cooldown to increase this radius by an additional 5."
LocFlyOverText="Eagle Eye"

[SnapShooting X2AbilityTemplate]
LocFriendlyName="Snap Shooting"
LocHelpText="Grants The Snap Shot, Snap Shot Overwatch, and Weapons Master abilities."
LocLongDescription="Grants The Snap Shot, Snap Shot Overwatch, and Weapons Master abilities."
LocPromotionPopupText="<Bullet/> Grants The Snap Shot, Snap Shot Overwatch, and Weapons Master abilities. \n<Bullet/> Allows you to move and shoot, or move and overwatch with your sniper rifle, and negates the short range penalty of sniper rifles."

[WeaponsMaster X2AbilityTemplate]
LocFriendlyName="Weapons Master"
LocHelpText="Negates the close range penalty of sniper rifles."
LocLongDescription="Negates the close range penalty of sniper rifles."
LocPromotionPopupText="<Bullet/> Negates the close range penalty of sniper rifles."

[GenevaFix X2AbilityTemplate]
LocFriendlyName="Geneva Fix"
LocHelpText="This fixes the issue that all of the mitzruti free grenade perks were reducing mobility."
LocLongDescription="This fixes the issue that all of the mitzruti free grenade perks were reducing mobility."
LocPromotionPopupText="<Bullet/> This fixes the issue that all of the mitzruti free grenade perks were reducing mobility. \n<Bullet/> This is done by making a perk that grants 1 Mobility when each of the mitzruti free grenade perks are taken. Aka a very janky way to fix it."

[ConcealingShot X2AbilityTemplate]
LocFriendlyName="Concealing Shot"
LocHelpText="A special pistol shot that will put you in concealment on kill."
LocLongDescription="A special pistol shot that will put you in concealment on kill."
LocPromotionPopupText="<Bullet/> A special pistol shot that will put you in concealment on kill. \n<Bullet/> 4 Turn Cooldown. \n<Bullet/> If you are already concealed, you will remain concealed if you kill the target."

[SilencedShot X2AbilityTemplate]
LocFriendlyName="Silenced Shot"
LocHelpText="An upgraded Concealing Shot that is non-turn ending, has no cooldown and will put you in concealment on kill."
LocLongDescription="An upgraded Concealing Shot that is non-turn ending, has no cooldown and will put you in concealment on kill.
LocPromotionPopupText="<Bullet/> An upgraded Concealing Shot that is non-turn ending, has no cooldown and will put you in concealment on kill. \n<Bullet/> If you are already concealed, you will remain concealed if you kill the target."

[HighNoon X2AbilityTemplate]
LocFriendlyName="High Noon"
LocHelpText="Negates the long range penalty of pistols."
LocLongDescription="Negates the long range penalty of pistols."
LocPromotionPopupText="<Bullet/> Negates the long range penalty of pistols."

[RupturingBlast X2AbilityTemplate]
LocFriendlyName="Rupturing Blast"
LocHelpText="A Special Shot that ruptures for 2 and deals a small amount of environmental damage to the target on a hit. Costs 2 Ammo."
LocLongDescription="A Special Shot that ruptures for 2 and deals a small amount of environmental damage to the target on a hit. Costs 2 Ammo."
LocPromotionPopupText="<Bullet/> A Special Shot that ruptures for 2 and deals a small amount of environmental damage to the target on a hit. Costs 2 Ammo. This shot benefits from its own rupture effect."

[RupturingBurst X2AbilityTemplate]
LocFriendlyName="Rupturing Burst"
LocHelpText="A Non Turn ending shot that ruptures for 3 and deals a large amount of environmental damage to the target on a hit. Costs 2 Ammo."
LocLongDescription="A Non Turn ending shot that ruptures for 3 and deals a large amount of environmental damage to the target on a hit. Costs 2 Ammo."
LocPromotionPopupText="<Bullet/> A Non Turn ending shot that ruptures for 3 and deals a large amount of environmental damage to the target on a hit. Costs 2 Ammo. This shot benefits from its own rupture effect."

[PRDemoMan X2AbilityTemplate]
LocFriendlyName="Demolitionist"
LocHelpText="Grants the Sapper and Tandem Warheads abilities when equipped with a grenade launcher or the Blast Off and Rocket launcher abilities when equipped with a rocket launcher."
LocLongDescription="Grants the Sapper and Tandem Warheads abilities when equipped with a grenade launcher or the Blast Off and Rocket launcher abilities when equipped with a rocket launcher."
LocPromotionPopupText="<Bullet/> Grants the Sapper and Tandem Warheads abilities when equipped with a grenade launcher or the Blast Off and Rocket launcher abilities when equipped with a rocket launcher."

[PRDemoMan2 X2AbilityTemplate]
LocFriendlyName="Deconstruction"
LocHelpText="Grants the Combat Engineer ability when equipped with a grenade launcher or the Fire in the Hole ability when equipped with a rocket launcher."
LocLongDescription="Grants the Combat Engineer ability when equipped with a grenade launcher or the Fire in the Hole ability when equipped with a rocket launcher."
LocPromotionPopupText="<Bullet/> Grants the Combat Engineer ability when equipped with a grenade launcher or the Fire in the Hole ability when equipped with a rocket launcher."

[LethalInjection X2AbilityTemplate]
LocFriendlyName="Lethal Injection"
LocHelpText="A Non Turn Ending shot that poisons and disorients an enemy. Can be used once per turn. Costs 2 Ammo."
LocLongDescription="A Non Turn Ending shot that poisons and disorients an enemy. Can be used once per turn. Costs 2 Ammo."
LocPromotionPopupText="<Bullet/> A Non Turn Ending shot that poisons and disorients an enemy. Can be used once per turn. Costs 2 Ammo."

[LethalInjectionConceal X2AbilityTemplate]
LocFriendlyName="Cold Case"
LocHelpText="Lethal Injection will now conceal you on kill."
LocLongDescription="Lethal Injection will now conceal you on kill."
LocPromotionPopupText="<Bullet/> Lethal Injection will now conceal you on kill."

[PRFlare X2AbilityTemplate]
LocFriendlyName="Flare"
LocHelpText="A special pistol shot that will set an enemy on fire and cause them to reposition."
LocLongDescription="A special pistol shot that will set an enemy on fire and cause them to reposition."
LocPromotionPopupText="<Bullet/> A special pistol shot that will set an enemy on fire and cause them to reposition. Can be used once per turn."

[VolatileFlare X2AbilityTemplate]
LocFriendlyName="Volatile Flare"
LocHelpText="A special pistol shot that will set an enemy on fire, cause them to bleed, poison them, cover them in acid, and cause them to reposition."
LocLongDescription="A special pistol shot that will set an enemy on fire, cause them to bleed, poison them, cover them in acid, and cause them to reposition."
LocPromotionPopupText="<Bullet/> A special pistol shot that will set an enemy on fire, cause them to bleed, poison them, cover them in acid, and cause them to reposition. Can be used Once Per Turn."

[Combustion X2AbilityTemplate]
LocFriendlyName="Combustion"
LocHelpText="The first time you fire your immolator in a turn, you will refund the action used."
LocLongDescription="The first time you fire your immolator in a turn, you will refund the action used."
LocPromotionPopupText="<Bullet/> The first time you fire your immolator in a turn, you will refund the action used."

[ElectricalSurge X2AbilityTemplate]
LocFriendlyName="Electrical Surge"
LocHelpText="An armor piercing shot that disables shields and reduces hack defense of robots by 20. Costs 2 Ammo"
LocLongDescription="An armor piercing shot that disables shields and reduces hack defense of robots by 20. Costs 2 Ammo"
LocPromotionPopupText="<Bullet/> An armor piercing shot that disables shields and reduces hack defense of robots by 20. Costs 2 Ammo"

[ElectricalStorm X2AbilityTemplate]
LocFriendlyName="Electrical Storm"
LocHelpText="A Non Turn Ending armor piercing shot that disables shields and reduces hack defense of robots by 20. Costs 2 Ammo"
LocLongDescription="A Non Turn Ending armor piercing shot that disables shields and reduces hack defense of robots by 20. Costs 2 Ammo"
LocPromotionPopupText="<Bullet/> A Non Turn Ending armor piercing shot that disables shields and reduces hack defense of robots by 20. Costs 2 Ammo"

[PowerOutage X2AbilityTemplate]
LocFriendlyName="PowerOutage"
LocHelpText="Electrical Surge and Electrical Storm stun robotic enemies for 2 Actions."
LocLongDescription="Electrical Surge and Electrical Storm stun robotic enemies for 2 Actions."
LocPromotionPopupText="<Bullet/> Electrical Surge and Electrical Storm stun robotic enemies for 2 Actions."

[PRArcMaster X2AbilityTemplate]
LocFriendlyName="Arc Master"
LocHelpText="Grants the Arc Lance and Cascading Arc Lance abilities."
LocLongDescription="Grants the Arc Lance and Cascading Arc Lance abilities."
LocPromotionPopupText="<Bullet/> Grants the Arc Lance and Cascading Arc Lance abilities. \n<Bullet/> Arc Lance damages enemies in a line based off your arcthrower damage. \n<Bullet/> Cascading Arc lance increases the damage dealt for each enemy hit. (The Damage Bonus is applied to the next enemy hit in the line)"

[SlicingShot X2AbilityTemplate]
LocFriendlyName="Slicing Shot"
LocHelpText="A Special Shot that costs 2 ammo, applies bleed, and grants a movement only action."
LocLongDescription="A Special Shot that costs 2 ammo, applies bleed, and grants a movement only action."
LocPromotionPopupText="<Bullet/> A Special Shot that costs 2 ammo, applies bleed, and grants a movement only action."

[SlicingShotMovement X2AbilityTemplate]
LocFriendlyName="Slicing Shot Movement"
LocHelpText="Slicing Shot will now grant you a movement action."
LocLongDescription="Slicing Shot will now grant you a movement action."
LocPromotionPopupText="<Bullet/> Slicing Shot will now grant you a movement action."

[SlicingWinds X2AbilityTemplate]
LocFriendlyName="Slicing Winds"
LocHelpText="Slicing Shot will now grant you an overwatch shot if you have at least 1 ammo in your weapon."
LocLongDescription="Slicing Shot will now grant you an overwatch shot if you have at least 1 ammo in your weapon."
LocPromotionPopupText="<Bullet/> Slicing Shot will now grant you an overwatch shot if you have at least 1 ammo in your weapon."

[SlicingStorm X2AbilityTemplate]
LocFriendlyName="Slicing Storm"
LocHelpText="Slicing Shot will now grant you a non-movement action."
LocLongDescription="Slicing Shot will now grant you a non-movement action."
LocPromotionPopupText="<Bullet/> Slicing Shot will now grant you a non-movement action."

[FrostSnap X2AbilityTemplate]
LocFriendlyName="Frost Snap"
LocHelpText="A Non-Turn Ending shot that costs 2 ammo and applies bitterfrost."
LocLongDescription="A Non-Turn Ending shot that costs 2 ammo and applies bitterfrost."
LocPromotionPopupText="<Bullet/> A Non-Turn Ending shot that costs 2 ammo and applies bitterfrost. Can be used as Pseudo Snapshot or Light Em Up."

[FrostSnapWhiteDeath X2AbilityTemplate]
LocFriendlyName="Glacial Snap"
LocHelpText="A Non-Turn Ending shot that costs 1 ammo and applies bitterfrost."
LocLongDescription="A Non-Turn Ending shot that costs 1 ammo and applies bitterfrost."
LocPromotionPopupText="<Bullet/> A Non-Turn Ending shot that costs 1 ammo and applies bitterfrost."

[IcyWindsWhiteDeath X2AbilityTemplate]
LocFriendlyName="Glacial Winds"
LocHelpText="Costs 2 Actions. Delay your shot until the enemy moves or attacks with a 20 aim bonus. Applies Bitterfrost on Hit. 1 Turn Cooldown."
LocLongDescription="Costs 2 Actions. Delay your shot until the enemy moves or attacks with a 20 aim bonus. Applies Bitterfrost on Hit. 1 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Costs 2 Actions. Delay your shot until the enemy moves or attacks with a 20 aim bonus. Applies Bitterfrost on Hit. 1 Turn Cooldown."

[IcyWinds X2AbilityTemplate]
LocFriendlyName="Icy Winds"
LocHelpText="Costs 2 Actions. Delay your shot until the enemy moves or attacks with a 20 aim bonus. Applies Bitterfrost on Hit. 3 Turn Cooldown."
LocLongDescription="Costs 2 Actions. Delay your shot until the enemy moves or attacks with a 20 aim bonus. Applies Bitterfrost on Hit. 3 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Costs 2 Actions. Delay your shot until the enemy moves or attacks with a 20 aim bonus. Applies Bitterfrost on Hit. 3 Turn Cooldown."

[WhiteDeath X2AbilityTemplate]
LocFriendlyName="White Death"
LocHelpText="Replaces Frost Snap with Glacial Snap. Glacial Snap costs 1 Ammo instead of 2. Replaces Icy Winds with Glacial Winds. Glacial Winds has a 1 Turn Cooldown Instead of 3."
LocLongDescription="Replaces Frost Snap with Glacial Snap. Glacial Snap costs 1 Ammo instead of 2. Replaces Icy Winds with Glacial Winds. Glacial Winds has a 1 Turn Cooldown Instead of 3."
LocPromotionPopupText="<Bullet/> Replaces Frost Snap with Glacial Snap. Glacial Snap costs 1 Ammo instead of 2. Replaces Icy Winds with Glacial Winds. Glacial Winds has a 1 Turn Cooldown Instead of 3."

[AcidSlug X2AbilityTemplate]
LocFriendlyName="Acid Slug"
LocHelpText="A Special Shotgun attack that negates long range penalties, shreds 2 armor, and applies acid burning for 1 turn. Costs 2 Ammo."
LocLongDescription="A Special Shotgun attack that negates long range penalties, shreds 2 armor, and applies acid burning for 1 turn. Costs 2 Ammo."
LocPromotionPopupText="<Bullet/> A Special Shotgun attack that negates long range penalties, shreds 2 armor, and applies acid burning for 1 turn. Costs 2 Ammo. Can be used once per turn."

[AcidSplash X2AbilityTemplate]
LocFriendlyName="Acid Splash"
LocHelpText="A Special Shotgun attack that negates long range penalties, shreds 3 armor, and applies acid burning for 1 turn. Costs 2 Ammo. Non turn Ending."
LocLongDescription="A Special Shotgun attack that negates long range penalties, shreds 3 armor, and applies acid burning for 1 turn. Costs 2 Ammo. Non turn Ending."
LocPromotionPopupText="<Bullet/> A Special Shotgun attack that negates long range penalties, shreds 3 armor, and applies acid burning for 1 turn. Costs 2 Ammo. Non turn Ending. Has No Cooldown."

[AcidSlash X2AbilityTemplate]
LocFriendlyName="Acid Slash"
LocHelpText="A Dashing melee attack that shreds 2 armor and applies acid burning."
LocLongDescription="A Dashing melee attack that shreds 2 armor and applies acid burning."
LocPromotionPopupText="<Bullet/> A Dashing melee attack that shreds 2 armor and applies acid burning."

[AcidFang X2AbilityTemplate]
LocFriendlyName="Acid Fang"
LocHelpText="A non turn ending melee attack against enemies that shreds 2 armor and applies acid burning."
LocLongDescription="A non turn ending melee attack against enemies that shreds 2 armor and applies acid burning."
LocPromotionPopupText="<Bullet/> "A non turn ending melee attack against enemies that shreds 2 armor and applies acid burning."

[CausticDemise X2AbilityTemplate]
LocFriendlyName="Caustic Demise"
LocHelpText="Grants the Fastball and Devastation Perks. Also gives you three free acid grenades."
LocLongDescription="Grants the Fastball and Devastation Perks. Also gives you three free acid grenades."
LocPromotionPopupText="<Bullet/> You can activate fastball to make the next grenade you throw a free action. Devastation increase the radius of breach by 1 and grenades by 2. The three acid grenades still have innate grenade cooldown."

[GhostBullet X2AbilityTemplate]
LocFriendlyName="Ghost Bullet"
LocHelpText="A special pistol shot that costs 1 focus, but is a free action that can be used even after consuming all other actions."
LocLongDescription="A special pistol shot that costs 1 focus, but is a free action that can be used even after consuming all other actions."
LocPromotionPopupText="<Bullet/> A special pistol shot that costs 1 focus, but is a free action that can be used even after consuming all other actions. Can be used once per turn."

[ShadowBullet X2AbilityTemplate]
LocFriendlyName="Shadow Bullet"
LocHelpText="A special pistol shot that costs 2 focus, but is a free action that can be used even after consuming all other actions. It will grant concealment on kill."
LocLongDescription="A special pistol shot that costs 2 focus, but is a free action that can be used even after consuming all other actions. It will grant concealment on kill."
LocPromotionPopupText="<Bullet/> A special pistol shot that costs 2 focus, but is a free action that can be used even after consuming all other actions. It will grant concealment on kill. 2 Turn Cooldown."

[ShadowGrapple X2AbilityTemplate]
LocFriendlyName="Shadow Grapple"
LocHelpText="Shadow Grapple"
LocLongDescription="Shadow Grapple"
LocPromotionPopupText="<Bullet/> Shadow Grapple"

[GhostBulletStrikeTwice X2AbilityTemplate]
LocFriendlyName="Haunt"
LocHelpText="Ghost Bullet will fire an additional pistol shot at the target if they survive the initial shot."
LocLongDescription="Ghost Bullet will fire an additional pistol shot at the target if they survive the initial shot."
LocPromotionPopupText="<Bullet/> Ghost Bullet will fire an additional pistol shot at the target if they survive the initial shot."

[GhostBulletConceal X2AbilityTemplate]
LocFriendlyName="GhostBulletConceal"
LocHelpText="Negates the long range penalty of pistols."
LocLongDescription="Negates the long range penalty of pistols."
LocPromotionPopupText="<Bullet/> Negates the long range penalty of pistols."

[GhostBulletMovement X2AbilityTemplate]
LocFriendlyName="Paranormal Rush"
LocHelpText="Grants a movement-only action after using ghost bullet."
LocLongDescription="Grants a movement-only action after using ghost bullet."
LocPromotionPopupText="<Bullet/> Grants a movement-only action after using ghost bullet."

[GhostBulletStun X2AbilityTemplate]
LocFriendlyName="Lethargy"
LocHelpText="Ghost Bullet will stun for 1 action."
LocLongDescription="Ghost Bullet will stun for 1 action."
LocPromotionPopupText="<Bullet/> Ghost Bullet will stun for 1 action. Haunt will make this attack stun for 2 actions if both shots hit."

[CrusaderStrike X2AbilityTemplate]
LocFriendlyName="Crusader Strike"
LocHelpText="A sword attack at adjacent enemies."
LocLongDescription="A sword attack at adjacent enemies."
LocPromotionPopupText="<Bullet/> A sword attack at adjacent enemies."
LocFlyOverText="Crusader Strike"

[QuickAid X2AbilityTemplate]
LocFriendlyName="Quick Aid"
LocHelpText="The first time you use various support gremlin abilities in a turn you will refund one action point."
LocLongDescription="The first time you use various support gremlin abilities in a turn you will refund one action point."
LocPromotionPopupText="<Bullet/> Works with Aid Protocol, Shield Protocol, Medical Protocol, Rescue Protocol, Stealth Protocol, Stronghold Protocol, Phalanx Protocol, Revival Protocol, Scouting Protocol, Airdrop, Restorative Mist, and Combat Scanner."
LocFlyOverText="Quick Aid"

[ByMyCommand X2AbilityTemplate]
LocFriendlyName="By My Command"
LocHelpText="The first time you use an officer ability or cover me per turn you will refund the action point used."
LocLongDescription="The first time you use an officer ability or cover me per turn you will refund the action point used."
LocPromotionPopupText="<Bullet/> The first time you use an officer ability or cover me per turn you will refund the action point used."
LocFlyOverText="By My Command

[FlashyPlays X2AbilityTemplate]
LocFriendlyName="Flashy Plays"
LocHelpText="Flashbangs are no longer turn ending. +1 charge for each equipped flashbang."
LocLongDescription="Flashbangs are no longer turn ending. +1 charge for each equipped flashbang."
LocPromotionPopupText="<Bullet/> Flashbangs are no longer turn ending. +1 charge for each equipped flashbang."

[ScanningTechnology X2AbilityTemplate]
LocFriendlyName="Scanning Technology"
LocHelpText="Grants the Combat Scanner, and Improved Scanner Abilities."
LocLongDescription="Grants the Combat Scanner, and Improved Scanner Abilities."
LocPromotionPopupText="<Bullet/> Combat Scanner allows you to scan an area which holotargets and reveals enemies. Improved scanner makes it so scanned enemies are easier to crit."

[WatchdogsProtection X2AbilityTemplate]
LocFriendlyName="Watchdogs Protection"
LocHelpText="Grants the Armour System and Healing Aid Abilities"
LocLongDescription="Grants the Armour System and Healing Aid Abilities"
LocPromotionPopupText="<Bullet/> Armour System causes aid protocol to repair armour as well as grant 1 armour while aid protocol is active. \n<Bullet/> Healing Aid causes your Aid Protocol to heal based on your hack score as well as cleanse effects as if you were applying a medikit"
LocFlyOverText="Watchdogs Protection"

[OppressiveFire X2AbilityTemplate]
LocFriendlyName="Oppressive Fire"
LocHelpText="Grants Focus and Opportunist enhancing overwatch shots"
LocLongDescription="Grants Focus and Opportunist enhancing overwatch shots"
LocPromotionPopupText="<Bullet/> Focus causes your first overwatch shot to be guaranteed to hit. \n<Bullet/> Opportunist causes your other overwatch shots to ignore half of cover bonuses."
LocFlyOverText="Oppressive Fire"

[MaraudersRage X2AbilityTemplate]
LocFriendlyName="Marauders Rage"
LocHelpText="The Marauders Rage allows them to thrive in the midst of combat gaining the Brawler and Infighter abilities."
LocLongDescription="The Marauders Rage allows them to thrive in the midst of combat gaining the Brawler, and Infighter abilities."
LocPromotionPopupText="<Bullet/> The Marauders Rage allows them to thrive in the midst of combat gaining the Brawler, and Infighter abilities. \n<Bullet/> Brawler reduces damage taken from sources within 4 tiles by 35%. \n<Bullet/> Infighter grants 40 dodge against attacks from sources within 4 tiles."

[OppressiveFireMalus X2AbilityTemplate]
LocFriendlyName="Oppressive Fire"
LocHelpText="An enhanced covering fire that applies an even stronger aim malus"
LocLongDescription="An enhanced covering fire that applies an even stronger aim malus"
LocPromotionPopupText="<Bullet/> An enhanced covering fire that applies an even stronger aim malus and ignores cover bonuses."
LocFlyOverText="Oppressive Fire"

[ExtendedRange X2AbilityTemplate]
LocFriendlyName="Extended Range"
LocHelpText="Grants the Javelin Rocket, and Incinerator Perks."
LocLongDescription="Grants the Javelin Rocket, and Incinerator Perks. Javelin Rockets increases the range you can launch rockets by 6 tiles. Incinerator increases the range you can use the flamethrower by 1 tile."
LocPromotionPopupText="<Bullet/> Grants the Javelin Rocket, and Incinerator Perks."

[CullTheWeak X2AbilityTemplate]
LocFriendlyName="Cull The Weak"
LocHelpText="Puts you on overwatch after using roust, flamethrower, throwing a grenade, or using the gauntlets rocket launcher."
LocLongDescription="Puts you on overwatch after using roust, flamethrower, throwing a grenade, or using the gauntlets rocket launcher."
LocPromotionPopupText="<Bullet/> Puts you on overwatch after using roust, flamethrower, throwing a grenade, or using the gauntlets rocket launcher."

[SwiftThrow X2AbilityTemplate]
LocFriendlyName="Swift Throw"
LocHelpText="Throw a knife as a free action. 4 Turn Cooldown."
LocLongDescription="Throw a knife as a free action. 4 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Throw a knife as a free action. 4 Turn Cooldown. \n<Bullet/> Currently does not apply rend the marked, bluescreen, or Impersonal Edge, Working on That."

[TacticalRetreat X2AbilityTemplate]
LocFriendlyName="Tactical Retreat"
LocHelpText="Tactical Retreat"
LocLongDescription="Grants a movement only action after throwing a knife. This can happen multiple times in a turn. Standard Throwing knife attack is now non-turn ending."
LocPromotionPopupText="<Bullet/> Grants a movement only action after throwing a knife. This can happen multiple times in a turn. Standard Throwing knife attack is now turn ending. \n<Bullet/> Additional grants the Quick Draw Ability."

[HastenedResolve X2AbilityTemplate]
LocFriendlyName="Hastened Resolve"
LocHelpText="Using One For all will grant a non-movement action."
LocLongDescription="Using One For all will grant a non-movement action."
LocPromotionPopupText="<Bullet/> Using One For all will grant a non-movement action."
LocFlyOverText="Hastened Resolve"

[BulletArtist X2AbilityTemplate]
LocFriendlyName="Bullet Artist"
LocHelpText="This soldier has trained and enhanced their usage of bullet arts, granting 2 more charges of their bullet art and causing it to deal more damage."
LocLongDescription="This soldier has trained and enhanced their usage of bullet arts, granting 2 more charges of their bullet art and causing it to deal more damage."
LocPromotionPopupText="<Bullet/> This soldier has trained and enhanced their usage of bullet arts, granting 2 more charges of their bullet art and causing it to deal more damage."

[BlackBulletArtist X2AbilityTemplate]
LocFriendlyName="Black Bullet Artist"
LocHelpText="Further upgrades black bullet to deal more damage over time with blood curse and to stun enemies hit."
LocLongDescription="Further upgrades black bullet to deal more damage over time with blood curse and to stun enemies hit."
LocPromotionPopupText="<Bullet/> Further upgrades black bullet to deal more damage over time with blood curse and to stun enemies hit."

[FrostBulletArtist X2AbilityTemplate]
LocFriendlyName="Frost Bullet Artist"
LocHelpText="Further upgrades frost bullet to strike twice for 60% damage each hit, and apply hypothermia which deals damage over time based on chill level."
LocLongDescription="Further upgrades frost bullet to strike twice for 60% damage each hit, and apply hypothermia which deals damage over time based on chill level."
LocPromotionPopupText="<Bullet/> Further upgrades frost bullet to strike twice for 60% damage each hit, and apply hypothermia which deals damage over time based on chill level."

[BlazeBulletArtist X2AbilityTemplate]
LocFriendlyName="Blaze Bullet Artist"
LocHelpText="Further upgrades blaze bullet to massively enhance the damage over time of the burn."
LocLongDescription="Further upgrades blaze bullet to massively enhance the damage over time of the burn."
LocPromotionPopupText="<Bullet/> Further upgrades blaze bullet to massively enhance the damage over time of the burn."

[ToxicBulletArtist X2AbilityTemplate]
LocFriendlyName="Toxic Bullet Artist"
LocHelpText="Further upgrades toxic bullet to enhance the damage over time of their poison and it now applies disorient."
LocLongDescription="Further upgrades toxic bullet to enhance the damage over time of their poison and it now applies disorient."
LocPromotionPopupText="<Bullet/> Further upgrades toxic bullet to enhance the damage over time of their poison and it now applies disorient."

[AcidBulletArtist X2AbilityTemplate]
LocFriendlyName="Acid Bullet Artist"
LocHelpText="Further upgrades acid bullet to enhance the damage over time of their acid and it now reduces the damage the enemie deals."
LocLongDescription="Further upgrades acid bullet to enhance the damage over time of their acid and it now reduces the damage the enemie deals."
LocPromotionPopupText="<Bullet/> Further upgrades acid bullet to enhance the damage over time of their acid and it now reduces the damage the enemie deals."

[RuptureBulletArtist X2AbilityTemplate]
LocFriendlyName="Rupture Bullet Artist"
LocHelpText="Further upgrades rupture bullet to strike twice for 60% damage each hit, and to deal massive cover damage to the cover of enemies hit."
LocLongDescription="Further upgrades rupture bullet to strike twice for 60% damage each hit, and to deal massive cover damage to the cover of enemies hit."
LocPromotionPopupText="<Bullet/> Further upgrades rupture bullet to strike twice for 60% damage each hit, and to deal massive cover damage to the cover of enemies hit."

[SwordBulletArtist X2AbilityTemplate]
LocFriendlyName="Sword Bullet Artist"
LocHelpText="Further upgrades sword bullet to strike twice for 60% damage each hit, deal bonus damage to enemies based on their psi, and to reduce the cooldowns of their other abilities."
LocLongDescription="Further upgrades sword bullet to strike twice for 60% damage each hit, deal bonus damage to enemies based on their psi, and to reduce the cooldowns of their other abilities."
LocPromotionPopupText="<Bullet/> Further upgrades sword bullet to strike twice for 60% damage each hit, deal bonus damage to enemies based on their psi, and to reduce the cooldowns of their other abilities."

[QuickBulletArtist X2AbilityTemplate]
LocFriendlyName="Quick Bullet Artist"
LocHelpText="Upgrades all bullet arts to grant a non-movement action after being used."
LocLongDescription="Upgrades all bullet arts to grant a non-movement action after being used."
LocPromotionPopupText="<Bullet/> Upgrades all bullet arts to grant a non-movement action after being used."

[TotalWarfare X2AbilityTemplate]
LocFriendlyName="Total Warfare"
LocHelpText="Grants the Watch Them Run and Salvo Perks."
LocLongDescription="Grants the Watch Them Run and Salvo Perks."
LocPromotionPopupText="<Bullet/> Watch Them Run will put you on overwatch when you launch or throw a grenade, Salvo makes throwing a grenade or using a heavy weapon non-turn ending."

[BlindingWarfare X2AbilityTemplate]
LocFriendlyName="Blinding Warfare"
LocHelpText="Grants the Flashy Plays and Salvo Perks."
LocLongDescription="Grants the Flashy Plays and Salvo Perks."
LocPromotionPopupText="<Bullet/> Flashy Plays makes it so you gain an additional charge for each equipped flashbang, Salvo makes throwing a grenade or using a heavy weapon non-turn ending."

[DefensiveWarfare X2AbilityTemplate]
LocFriendlyName="Defensive Warfare"
LocHelpText="Grants the Smoke and Mirrors and Salvo Perks."
LocLongDescription="Grants the Smoke and Mirrors and Salvo Perks."
LocPromotionPopupText="<Bullet/> Smoke and Mirrors makes it so you gain an additional charge for each equipped smoke grenade, Salvo makes throwing a grenade or using a heavy weapon non-turn ending."

[PRGrenadier X2AbilityTemplate]
LocFriendlyName="Grenadier"
LocHelpText="Grants this unit a grenade slot."
LocLongDescription="Grants this unit a grenade slot."
LocPromotionPopupText="<Bullet/> Grants this unit a grenade slot."

[BishopsWill X2AbilityTemplate]
LocFriendlyName="Bishops Will"
LocHelpText="Once per turn when this unit is attacked they will generate 1 focus. They will also generate focus on kills with Dragon Breath abilities or attacks with their shield."
LocLongDescription="Once per turn when this unit is attacked they will generate 1 focus. They will also generate focus on kills with Dragon Breath abilities or attacks with their shield."
LocPromotionPopupText="<Bullet/> Once per turn when this unit is attacked they will generate 1 focus. They will also generate focus on kills with Dragon Breath abilities or attacks with their shield."

[TacticalMovement X2AbilityTemplate]
LocFriendlyName="Tactical Movement"
LocHelpText="Grants the parkour and failsafe ability"
LocLongDescription="Grants the parkour and failsafe ability."
LocPromotionPopupText="<Bullet/> Parkour allows the soldier to climb walls so long as a window or other obstruction is not in the way, failsafe prevents the negatives from failed hacks."

[PerfectedGuard X2AbilityTemplate]
LocFriendlyName="Perfected Guard"
LocHelpText="The first Guard you use per turn will be a free action."
LocLongDescription="The first Guard you use per turn will be a free action."
LocPromotionPopupText="<Bullet/>The first Guard you use per turn will be a free action."

[NoQuarter X2AbilityTemplate]
LocFriendlyName="No Quarter"
LocHelpText="Charge an enemy and strike them with the butt of your weapon, then follow up with a pistol shot."
LocLongDescription="Charge an enemy and strike them with the butt of your weapon, then follow up with a pistol shot."
LocPromotionPopupText="<Bullet/> Charge an enemy and strike them with the butt of your weapon, then follow up with a pistol shot. \n<Bullet/> The Charge attack and Pistol attack scale with pistol damage, melee damage, and ammo. \n<Bullet/> The follow up pistol shot is considered a melee attack. \n<Bullet/> The charge attack and pistol shot are seperate attacks that individually roll to hit or crit."

[NoQuarter2 X2AbilityTemplate]
LocFriendlyName="No Quarter"
LocHelpText="No Quarter"
LocLongDescription="No Quarter"
LocPromotionPopupText="<Bullet/>No Quarter"

[PRPA_GlacialThrow X2AbilityTemplate]
LocFriendlyName="Glacial Throw"
LocHelpText="Throw a Glacial Axe at your enemy (Animation Currently Not Working)"
LocLongDescription="Throw a Glacial Axe at your enemy (Animation Currently Not Working)"
LocPromotionPopupText="<Bullet/> Throw a Glacial Axe at your enemy (Animation Currently Not Working)"

[PRPA_GlacialAdvance X2AbilityTemplate]
LocFriendlyName="Glacial Advance"
LocHelpText="Frost Strike and Throwing Axe abilities grant a movement only action."
LocLongDescription="Frost Strike and Throwing Axe abilities grant a movement only action."
LocPromotionPopupText="<Bullet/> Frost Strike and Throwing Axe abilities grant a movement only action."

[PRPA_RushingIce X2AbilityTemplate]
LocFriendlyName="Rushing Ice"
LocHelpText="Firing your Cyrolator grants a movement only action."
LocLongDescription="Firing your Cyrolator grants a movement only action."
LocPromotionPopupText="<Bullet/> Firing your Cyrolator grants a movement only action."

[PRPA_FrostStrike X2AbilityTemplate]
LocFriendlyName="Frost Strike"
LocHelpText="Dash to a target and strike them with your axe applying chill."
LocLongDescription="Dash to a target and strike them with your axe applying chill."
LocPromotionPopupText="<Bullet/> Dash to a target and strike them with your axe applying chill."

[PRPA_ColdSnap X2AbilityTemplate]
LocFriendlyName="Cold Snap"
LocHelpText="Cold Snap"
LocLongDescription="Cold Snap"
LocPromotionPopupText="<Bullet/> Cold Snap"


[PRPA_RemorselessWinter X2AbilityTemplate]
LocFriendlyName="Remorseless Winter"
LocHelpText="Throw an Axe at target area dealing guaranteed damage to nearby enemies."
LocLongDescription="Throw an Axe at target area dealing guaranteed damage to nearby enemies."
LocPromotionPopupText="<Bullet/> Throw an Axe at target area dealing guaranteed damage to nearby enemies."

[PRPA_MountainKing X2AbilityTemplate]
LocFriendlyName="Mountain King"
LocHelpText="Throw an Axe at enemies who more or attack within 6 tiles."
LocLongDescription="Throw an Axe at enemies who more or attack within 6 tiles."
LocPromotionPopupText="<Bullet/> Throw an Axe at enemies who more or attack within 6 tiles."

[PRPA_FrostBlitz X2AbilityTemplate]
LocFriendlyName="Frost Blitz"
LocHelpText="Throw A Frosty Axe at an enemy as a free action."
LocLongDescription="Throw A Frosty Axe at an enemy as a free action."
LocPromotionPopupText="<Bullet/> Throw A Frosty Axe at an enemy as a free action."

[PRPA_HitAndChill X2AbilityTemplate]
LocFriendlyName="Hit And Chill"
LocHelpText="Throw A Frosty Axe at an enemy as a free action."
LocLongDescription="Throw A Frosty Axe at an enemy as a free action."
LocPromotionPopupText="<Bullet/> Throw A Frosty Axe at an enemy as a free action."

[PRPA_BurialAxe X2AbilityTemplate]
LocFriendlyName="Burial Axe"
LocHelpText="Throw an axe at your enemy, if it is lethal the actions are refunded (Animation Currently Not Working)"
LocLongDescription="Throw an axe at your enemy, if it is lethal the actions are refunded (Animation Currently Not Working)"
LocPromotionPopupText="<Bullet/> Throw an axe at your enemy, if it is lethal the actions are refunded (Animation Currently Not Working)"

[CloseQuarterDuelist X2AbilityTemplate]
LocFriendlyName="Close Quarter Duelist "
LocHelpText="Take a shot with your pistol at an enemy that moves or attacks within 4 tiles of you. Only procs on aliens turn."
LocLongDescription="Take a shot with your pistol at an enemy that moves or attacks within 4 tiles of you. Only procs on aliens turn. "
LocPromotionPopupText="<Bullet/>Take a shot with your pistol at an enemy that moves or attacks within 4 tiles of you. Only procs on aliens turn. Once Per Target."

[ExplosiveRush X2AbilityTemplate]
LocFriendlyName="ExplosiveRush  "
LocHelpText="ExplosiveRush "
LocLongDescription="ExplosiveRush  "
LocPromotionPopupText="<Bullet/>ExplosiveRush "

[SurgicalSwiftness X2AbilityTemplate]
LocFriendlyName="SurgicalSwiftness "
LocHelpText="SurgicalSwiftness"
LocLongDescription="SurgicalSwiftness"
LocPromotionPopupText="<Bullet/>SurgicalSwiftness"

[PRPA_RipAndTear X2AbilityTemplate]
LocFriendlyName="Rip And Tear"
LocHelpText="Make Three melee attacks against an adjacent enemy."
LocLongDescription="Make Three melee attacks against an adjacent enemy."
LocPromotionPopupText="<Bullet/> Make Three melee attacks against an adjacent enemy."

[PRPA_RipAndTearSecondStrike X2AbilityTemplate]
LocFriendlyName="Rip And Tear "
LocHelpText="Rip And Tear"
LocLongDescription="Rip And Tear"
LocPromotionPopupText="<Bullet/>Rip And Tear"

[PRPA_RipAndTearThirdStrike X2AbilityTemplate]
LocFriendlyName="Rip And Tear"
LocHelpText="Rip And Tear"
LocLongDescription="Rip And Tear"
LocPromotionPopupText="<Bullet/>Rip And Tear"

[PRPA_DivineJudgement X2AbilityTemplate]
LocFriendlyName="DivineJudgement"
LocHelpText="Justice and Wrath will refund the action used once per turn. Shared Cooldown"
LocLongDescription="Justice and Wrath will refund the action used once per turn. Shared Cooldown"
LocPromotionPopupText="<Bullet/>Justice and Wrath will refund the action used once per turn. Shared Cooldown"

[Roustafarian X2AbilityTemplate]
LocFriendlyName="Roustafarian"
LocHelpText="Grants 2 additional charges of roust."
LocLongDescription="Grants 2 additional charges of roust."
LocPromotionPopupText="<Bullet/>Grants 2 additional charges of roust."

[JackOfAllTrades X2AbilityTemplate]
LocFriendlyName="Jack of All Trades"
LocHelpText="Grants additional abilities based off of equipped Primary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary Weapon. \n<Bullet/> Sniper: Squadsight, Shooting Sharp. Vektor Rifle: Squadsight, Lead The Target. \n<Bullet/> Shotgun: Trenchgun. SMG: Phantom. \n<Bullet/> Rifle: Sentinel. Cannon: Suppressing Fire. \n<Bullet/> Bullpup: Implacable. Chemthrower: Chemthrower Suppression."

[Wildcard X2AbilityTemplate]
LocFriendlyName="Wild Card"
LocHelpText="Grants additional abilities based off of equipped Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Secondary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Secondary Weapon. \n<Bullet/> Gremlin: Hack, Haywire Protocol. Sawed-Off: Point Blank, Both Barrels. \n<Bullet/> Gauntlet: Heavy Arnaments, Roust. Arcthrower: Stun. \n<Bullet/> Pistol: High Noon, Quickdraw. Combat Knife: Knife Fighter, Lightning Knife. \n<Bullet/> Sword: Intercept, Fleche. Grenade Launcher: Improvise Explosive, Sapper. \n<Bullet/> Holotargeter: Holotarget, Multitargeting. Bit: Hack, Haywire Protocol. \n<Bullet/> Rocket: Blast Off, Rocket Launcher, Shield: Guard, Lightfoot."

[Highcard X2AbilityTemplate]
LocFriendlyName="High Card"
LocHelpText="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary and Secondary Weapon."
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary and Secondary Weapon. \n<Bullet/> Sniper: Executioneer. Vektor Rifle: This Ones Mine. \n<Bullet/> Shotgun: Predator. SMG: Stalker. \n<Bullet/> Rifle: Cool Under Pressure. Cannon: Covering Fire. \n<Bullet/> Bullpup: Marauder. Chemthrower: Nightmare Fuel. \n<Bullet/> Gremlin: Rescue Protocol. Sawed-Off: Pump Action. \n<Bullet/> Gauntlet: Fire In The Hole, Phosphorus. Arcthrower: Unlimited Power. \n<Bullet/> Pistol: Lightning Hands. Combat Knife: Combatives. \n<Bullet/> Sword: Shadowstep. Grenade Launcher: Fastball. \n<Bullet/> Holotargeter: Vital Point Targeting. Bit: Shellshock. \n<Bullet/> Rocket: Biggest Booms, Shield: Perfected Guard."

[Joker X2AbilityTemplate]
LocFriendlyName="Joker"
LocHelpText="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary and Secondary Weapon. \n<Bullet/> Sniper: Lock N Load. Vektor Rifle: Watchful Eye (This Ones Mine). \n<Bullet/> Shotgun: Hunters Instinct. SMG: Conceal. \n<Bullet/> Rifle: Concentration. Cannon: Improved Suppression. \n<Bullet/> Bullpup: Center Mass. Chemthrower: Oppressive Heat. \n<Bullet/> Gremlin: Medical Protocol. Sawed-Off: Scrap Metal. \n<Bullet/> Gauntlet: Javeling Rockets, Incinerator. Arcthrower: Jolt Awake, Boost Move. \n<Bullet/> Pistol: Franctic Fire. Combat Knife: Bladestorm. \n<Bullet/> Sword: Covering Fire. Grenade Launcher: Combat Engineer. \n<Bullet/> Holotargeter: Rapid Targeting. Bit: Rocketeer. \n<Bullet/> Rocket: Fire In the Hole, Shield: Blurred."

[RoyalFlush X2AbilityTemplate]
LocFriendlyName="Royal Flush"
LocHelpText="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocLongDescription="Grants additional abilities based off of equipped Primary and Secondary Weapon"
LocPromotionPopupText="<Bullet/>Grants additional abilities based off of equipped Primary and Secondary Weapon. \n<Bullet/> Sniper: Burial Shot. Vektor Rifle: Stay On Target. \n<Bullet/> Shotgun: Run and Gun. SMG: Quick Feet. \n<Bullet/> Rifle: Opportunist. Cannon: Disabling Suppression. \n<Bullet/> Bullpup: Double Time. Chemthrower: Hotshot. \n<Bullet/> Gremlin: Shield Protocol. Sawed-Off: Whippit. \n<Bullet/> Gauntlet: Salvo, Quick Burn. Arcthrower: Quick Zap. \n<Bullet/> Pistol: I Meant to do That. Combat Knife: Reblossom. \n<Bullet/> Sword: Rout. Grenade Launcher: Devastation. \n<Bullet/> Holotargeter: Watchful Eye. Bit: Bombard. \n<Bullet/> Rocket: Salvo, Shield: Resilience"

[CallShot X2AbilityTemplate]
LocFriendlyName="Call Shot"
LocHelpText="Grants The Mark Target ability, and causes Mark Target to refund the actions used once per turn. Mark Target increase aim against a target for 2 turns with a 3 Turn Cooldown."
LocLongDescription="Grants The Mark Target ability, and causes Mark Target to refund the actions used once per turn. Mark Target increase aim against a target for 2 turns with a 3 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Grants The Mark Target ability, and causes Mark Target to refund the actions used once per turn. Mark Target increase aim against a target for 2 turns with a 3 Turn Cooldown."

[DuckAndCover X2AbilityTemplate]
LocFriendlyName="Duck and Cover"
LocHelpText="Grants The Aim and Trench Warfare Perks. Aim increase your Aim and Crit by 20 after hunkering down, Trench Warfare will hunker you down at end of turn if you have killed an enemy."
LocLongDescription="Grants The Aim and Trench Warfare Perks. Aim increase your Aim and Crit by 20 after hunkering down, Trench Warfare will hunker you down at end of turn if you have killed an enemy."
LocPromotionPopupText="<Bullet/> Grants The Aim and Trench Warfare Perks. Aim increase your Aim and Crit by 20 after hunkering down, Trench Warfare will hunker you down at end of turn if you have killed an enemy."

[ToHellAndBack X2AbilityTemplate]
LocFriendlyName="To Hell and Back"
LocHelpText="Grants 3 Incendiary Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Incendiary Grenades, not 9 from this perk."
LocLongDescription="Grants 3 Incendiary Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Incendiary Grenades, not 9 from this perk."
LocPromotionPopupText="<Bullet/> Grants 3 Incendiary Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Incendiary Grenades, not 9 from this perk."

[ToHellAndBack1 X2AbilityTemplate]
LocFriendlyName="To Hell and Back - First Grenade"
LocHelpText="To Hell and Back - First Grenade"
LocLongDescription="To Hell and Back - First Grenade"
LocPromotionPopupText="<Bullet/> To Hell and Back - First Grenade"

[ToHellAndBack2 X2AbilityTemplate]
LocFriendlyName="To Hell and Back - Second Grenade"
LocHelpText="To Hell and Back - Second Grenade"
LocLongDescription="To Hell and Back - Second Grenade"
LocPromotionPopupText="<Bullet/> To Hell and Back - Second Grenade"

[ToHellAndBack3 X2AbilityTemplate]
LocFriendlyName="To Hell and Back - Third Grenade"
LocHelpText="To Hell and Back - Third Grenade"
LocLongDescription="To Hell and Back - Third Grenade"
LocPromotionPopupText="<Bullet/> To Hell and Back - Third Grenade"

[GasGasGas X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas"
LocHelpText="Grants 3 Gas Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Gas Grenades, not 9 from this perk."
LocLongDescription="Grants 3 Gas Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Gas Grenades, not 9 from this perk."
LocPromotionPopupText="<Bullet/> Grants 3 Gas Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Gas Grenades, not 9 from this perk."

[gasgasgas1 X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas - First Grenade"
LocHelpText="Gas Gas Gas - First Grenade"
LocLongDescription="Gas Gas Gas - First Grenade"
LocPromotionPopupText="<Bullet/> Gas Gas Gas - First Grenade"

[gasgasgas2 X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas - Second Grenade"
LocHelpText="Gas Gas Gas - Second Grenade"
LocLongDescription="Gas Gas Gas - Second Grenade"
LocPromotionPopupText="<Bullet/> Gas Gas Gas - Second Grenade"

[gasgasgas3 X2AbilityTemplate]
LocFriendlyName="Gas Gas Gas - Third Grenade"
LocHelpText="Gas Gas Gas - Third Grenade"
LocLongDescription="Gas Gas Gas - Third Grenade"
LocPromotionPopupText="<Bullet/> Gas Gas Gas - Third Grenade"

[CausticArsenal X2AbilityTemplate]
LocFriendlyName="CausticArsenal"
LocHelpText="Grants 3 Acid Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Acid Grenades, not 9 from this perk."
LocLongDescription="Grants 3 Acid Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Acid Grenades, not 9 from this perk."
LocPromotionPopupText="<Bullet/> Grants 3 Acid Grenades. These grenades are effected by the damage reduction of light ordinance, but you will get 3 Acid Grenades, not 9 from this perk."

[CausticArsenal1 X2AbilityTemplate]
LocFriendlyName="CausticArsenal - First Grenade"
LocHelpText="CausticArsenal - First Grenade"
LocLongDescription="CausticArsenal - First Grenade"
LocPromotionPopupText="<Bullet/> CausticArsenal - First Grenade"

[CausticArsenal2 X2AbilityTemplate]
LocFriendlyName="CausticArsenal - Second Grenade"
LocHelpText="CausticArsenal - Second Grenade"
LocLongDescription="CausticArsenal - Second Grenade"
LocPromotionPopupText="<Bullet/> CausticArsenal - Second Grenade"

[CausticArsenal3 X2AbilityTemplate]
LocFriendlyName="CausticArsenal - Third Grenade"
LocHelpText="CausticArsenal - Third Grenade"
LocLongDescription="CausticArsenal - Third Grenade"
LocPromotionPopupText="<Bullet/> CausticArsenal - Third Grenade"

[FanTheHammer X2AbilityTemplate]
LocFriendlyName="Fan The Hammer"
LocHelpText="Fire your pistol up to three times at a target. 2 Turn Cooldown. Costs 3 Ammo. Requires 2 Actions."
LocLongDescription="Fire your pistol up to three times at a target. 2 Turn Cooldown. Costs 3 Ammo. Requires 2 Actions."
LocPromotionPopupText="<Bullet/> Fire your pistol up to three times at a target. 2 Turn Cooldown. Requires 2 Actions. \n<Bullet/> Costs 3 Ammo, but will only use ammo based of the times you shoot. \n<Bullet/> You will stop shooting if the target dies early. \n<Bullet/> Auto-Loader Recommended as Expanded mags don't seem to work on pistols. \n<Bullet/> Does not Work with Quick Draw and Will Not Refund actions with Liquidator."

[Sheriff X2AbilityTemplate]
LocFriendlyName="Sheriff"
LocHelpText="Grants the Watchful Eye (Holotargeter) and Cool Under Pressure abilities."
LocLongDescription="Grants the Watchful Eye (Holotargeter) and Cool Under Pressure abilities."
LocPromotionPopupText="<Bullet/> Grants the Watchful Eye (Holotargeter) and Cool Under Pressure abilities. Cool Under Pressure: +10 Aim on Reaction Shots, Reaction Shots can Crit. Watchful Eye: Take a shot at enemies you have holotargeted when they move or attack. Once per enemy per turn."

[DualStrike X2AbilityTemplate]
LocFriendlyName="Dual Strike"
LocHelpText="Charge a target and strike with your two swords."
LocLongDescription="Charge a target and strike with your two swords."
LocPromotionPopupText="<Bullet/> Charge a target and strike with your two swords."

[DualSlash X2AbilityTemplate]
LocFriendlyName="Dual Slash"
LocHelpText="Slash at an adjacent target with your two swords."
LocLongDescription="Slash at an adjacent target with your two swords."
LocPromotionPopupText="<Bullet/> Slash at an adjacent target with your two swords. Non Turn Ending."

[BattleRush X2AbilityTemplate]
LocFriendlyName="Battle Rush"
LocHelpText="Dual Strike and Dual Slash grant a movement only action."
LocLongDescription="Dual Strike and Dual Slash grant a movement only action."
LocPromotionPopupText="<Bullet/> Dual Strike and Dual Slash grant a movement only action."

[WakingBlizzard X2AbilityTemplate]
LocFriendlyName="Waking Blizzard"
LocHelpText="Charge a target and strike with a frosty slash and inflict bitterfrost."
LocLongDescription="Charge a target and strike with a frosty slash and inflict bitterfrost."
LocPromotionPopupText="<Bullet/> Charge a target and strike with a frosty slash and inflict bitterfrost."

[PR_FireRocketLauncher X2AbilityTemplate]
LocFriendlyName="PR_FireRocketLauncher"
LocHelpText="PR_FireRocketLauncher"
LocLongDescription="PR_FireRocketLauncher"
LocPromotionPopupText="<Bullet/> PR_FireRocketLauncher"

[PRPA_BatteringRam X2AbilityTemplate]
LocFriendlyName="Battering Ram"
LocHelpText="An Upgraded Shield Bash that has increased knockback and no cooldown."
LocLongDescription="An Upgraded Shield Bash that has increased knockback and no cooldown."
LocPromotionPopupText="<Bullet/> An Upgraded Shield Bash that has increased knockback and no cooldown."

[PRPA_Stunlance X2AbilityTemplate]
LocFriendlyName="Stunlance"
LocHelpText="Charge an enemy and prod them with your stunlance. Disorients target and has a 25% to Stun for 2 Actions."
LocLongDescription="Charge an enemy and prod them with your stunlance. Disorients target and has a 25% to Stun for 2 Actions."
LocPromotionPopupText="<Bullet/> Charge an enemy and prod them with your stunlance. Disorients target and has a 25% to Stun for 2 Actions."

[PRPA_StunAndSlice X2AbilityTemplate]
LocFriendlyName="Stun And Slice"
LocHelpText="Charge an enemy and prod them with your stunlance. Disorients and has a 25% to Stun for 2 Actions. Does not end your turn. 4 Turn Cooldown."
LocLongDescription="Charge an enemy and prod them with your stunlance. Disorients and has a 25% to Stun for 2 Actions. Does not end your turn. 4 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Charge an enemy and prod them with your stunlance. Disorients and has a 25% to Stun for 2 Actions. Does not end your turn. 4 Turn Cooldown."

[PRPA_AssaultStun X2AbilityTemplate]
LocFriendlyName="Assault Stun"
LocHelpText="Charge an enemy and prod them with your stunlance. Disorients and Stuns for 2 Actions. 3 Turn Cooldown."
LocLongDescription="Charge an enemy and prod them with your stunlance. Disorients and Stuns for 2 Actions. 3 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Charge an enemy and prod them with your stunlance. Disorients and Stuns for 2 Actions. 3 Turn Cooldown."

[PRPA_ToxinSlash X2AbilityTemplate]
LocFriendlyName="Toxin Slash"
LocHelpText="Charge an enemy and slash them with your Bio Saber. Disorients, and Stuns the target for 1 Action."
LocLongDescription="Charge an enemy and slash them with your Bio Saber. Disorients, and Stuns the target for 1 Action."
LocPromotionPopupText="<Bullet/> Charge an enemy and slash them with your Bio Saber. Disorients, and Stuns the target for 1 Action."

[PRPA_VictoriousAssault X2AbilityTemplate]
LocFriendlyName="Victorious Assault"
LocHelpText="Assault Stun additionally grants a Non-Movement Action."
LocLongDescription="Assault Stun additionally grants a Non-Movement Action."
LocPromotionPopupText="<Bullet/> Assault Stun additionally grants a Non-Movement Action."

[PRPA_StreetSmarts X2AbilityTemplate]
LocFriendlyName="Street Smarts"
LocHelpText="Street Smarts"
LocLongDescription="Street Smarts"
LocPromotionPopupText="<Bullet/> Street Smarts"

[PRPA_SmartScanMk1 X2AbilityTemplate]
LocFriendlyName="Smart Scan1"
LocHelpText="Smart Scan"
LocLongDescription="Smart Scan"
LocPromotionPopupText="<Bullet/> Smart Scan"

[PRPA_SmartScanMk2 X2AbilityTemplate]
LocFriendlyName="Smart Scan2"
LocHelpText="Smart Scan"
LocLongDescription="Smart Scan"
LocPromotionPopupText="<Bullet/> Smart Scan"

[PRPA_SmartScanMk3 X2AbilityTemplate]
LocFriendlyName="Smart Scan3"
LocHelpText="Smart Scan"
LocLongDescription="Smart Scan"
LocPromotionPopupText="<Bullet/> Smart Scan"

[PRPA_StunMineMk1 X2AbilityTemplate]
LocFriendlyName="Free Stun Mine 1"
LocHelpText="Free Stun Mine 1 - Temporary fix for pathfinder stun mine until i get the ability working."
LocLongDescription="Free Stun Mine 1"
LocPromotionPopupText="<Bullet/> Free Stun Mine 1"

[PRPA_StunMineMk2 X2AbilityTemplate]
LocFriendlyName="Free Stun Mine 2"
LocHelpText="Free Stun Mine 1 - Temporary fix for pathfinder stun mine until i get the ability working."
LocLongDescription="Free Stun Mine 1"
LocPromotionPopupText="<Bullet/> Free Stun Mine 1"

[PRPA_StunMineMk3 X2AbilityTemplate]
LocFriendlyName="Stun Mine Mk3"
LocHelpText="Free Stun Mine 1 - Temporary fix for pathfinder stun mine until i get the ability working."
LocLongDescription="Free Stun Mine 1"
LocPromotionPopupText="<Bullet/> Free Stun Mine 1"

[PRPA_FrostBlaster X2AbilityTemplate]
LocFriendlyName="Frost Blaster"
LocHelpText="Blast target enemies in a cone infront of you applying chill to all targets hit. 4 Turn Cooldown."
LocLongDescription="Blast target enemies in a cone infront of you applying chill to all targets hit. 4 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Blast target enemies in a cone infront of you applying chill to all targets hit. 4 Turn Cooldown."

[PRPA_FrostSweeper X2AbilityTemplate]
LocFriendlyName="Frost Sweeper"
LocHelpText="Blast target enemies in a large cone infront of you applying chill to all targets hit. 4 Turn Cooldown."
LocLongDescription="Blast target enemies in a large cone infront of you applying chill to all targets hit. 4 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Blast target enemies in a large cone infront of you applying chill to all targets hit. 4 Turn Cooldown.r"

[PRPA_SlipperyGetAway X2AbilityTemplate]
LocFriendlyName="Slippery Get Away"
LocHelpText="Frost Blaster and Frost Sweeper grant a movement only action after use."
LocLongDescription="Frost Blaster and Frost Sweeper grant a movement only action after use."
LocPromotionPopupText="<Bullet/> Frost Blaster and Frost Sweeper grant a movement only action after use."

[PRPA_IceAndDice X2AbilityTemplate]
LocFriendlyName="Ice And Dice"
LocHelpText="Replaces Slash. Strike an adjacent enemy twice with your frost axe."
LocLongDescription="Replaces Slash. Strike an adjacent enemy twice with your frost axe."
LocPromotionPopupText="<Bullet/> Replaces Slash. Strike an adjacent enemy twice with your frost axe."

[PRPA_IceAndDiceSecondStrike X2AbilityTemplate]
LocFriendlyName="Ice And Dice Second Strike"
LocHelpText="Replaces Slash. Strike an adjacent enemy twice with your frost axe."
LocLongDescription="FReplaces Slash. Strike an adjacent enemy twice with your frost axe."
LocPromotionPopupText="<Bullet/> Replaces Slash. Strike an adjacent enemy twice with your frost axe."

[PRPA_FlowingStrike X2AbilityTemplate]
LocFriendlyName="Flowing Strike"
LocHelpText="Dash towards a chilled target and make a non-turn ending melee attack. Currently Does Not Work"
LocLongDescription="Dash towards a chilled target and make a non-turn ending melee attack. Currently Does Not Work"
LocPromotionPopupText="<Bullet/> Dash towards a chilled target and make a non-turn ending melee attack. Currently Does Not Work"

[PRPA_FrostBreach X2AbilityTemplate]
LocFriendlyName="Frost Breach"
LocHelpText="Destroy Cover and deal a small amount of guaranteed damage in an area and apply chill."
LocLongDescription="Destroy Cover and deal a small amount of guaranteed damage in an area and apply chill."
LocPromotionPopupText="<Bullet/> Destroy Cover and deal a small amount of guaranteed damage in an area and apply chill."

[PRPA_AirStrike X2AbilityTemplate]
LocFriendlyName="Air Strike"
LocHelpText="Call an airstrike at target location. Dropping a powerful bomb on the area that deals heavy environmental damage. 8 Turn Cooldown."
LocLongDescription="Call an airstrike at target location. Dropping a powerful bomb on the area that deals heavy environmental damage. 8 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Call an airstrike at target location. Dropping a powerful bomb on the area that deals heavy environmental damage. 8 Turn Cooldown."

[PRPA_BioAirStrike X2AbilityTemplate]
LocFriendlyName="Bio Air Strike"
LocHelpText="Call an airstrike at target location. Dropping a deadly neurotoxin on the area that poisons and disorients enemies. 8 Turn Cooldown."
LocLongDescription="Call an airstrike at target location. Dropping a deadly neurotoxin on the area that poisons and disorients enemies. 8 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Call an airstrike at target location. Dropping a deadly neurotoxin on the area that poisons and disorients enemies. 8 Turn Cooldown."

[PRPA_FrostAirStrike X2AbilityTemplate]
LocFriendlyName="Frost Air Strike"
LocHelpText="Call an airstrike at target location. Dropping a cloud of chilling mist on the area that chills enemies. Deals bonus damage against chilled or frozen enemies. 8 Turn Cooldown."
LocLongDescription="Call an airstrike at target location. Dropping a cloud of chilling mist on the area that chills enemies. Deals bonus damage against chilled or frozen enemies. 8 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Call an airstrike at target location. Dropping a cloud of chilling mist on the area that chills enemies. Deals bonus damage against chilled or frozen enemies. 8 Turn Cooldown."

[PRPA_SteadfastProtector X2AbilityTemplate]
LocFriendlyName="Steadfast Protector"
LocHelpText="Taunt and Energy Shield abilities grant a non-movement action."
LocLongDescription="Taunt and Energy Shield abilities grant a non-movement action."
LocPromotionPopupText="<Bullet/> Taunt and Energy Shield abilities grant a non-movement action."

[PRPA_AdventPurifierFlamethrower X2AbilityTemplate]
LocFriendlyName="Advent Purifier Flamethrower"
LocHelpText="Advent Purifier Flamethrower"
LocLongDescription="Advent Purifier Flamethrower"
LocPromotionPopupText="<Bullet/>Advent Purifier Flamethrower"

[PRPA_AdvancedPurifierFlamethrower X2AbilityTemplate]
LocFriendlyName="Advanced Purifier Flamethrower"
LocHelpText="An Advanced Purifier Flamethrower that ignores fire immunity and shreds armour."
LocLongDescription="An Advanced Purifier Flamethrower that ignores fire immunity and shreds armour."
LocPromotionPopupText="<Bullet/> An Advanced Purifier Flamethrower that ignores fire immunity and shreds armour."

[PRPA_SuperiorPurifierFlamethrower X2AbilityTemplate]
LocFriendlyName="Superior Purifier Flamethrower"
LocHelpText="An Superior Purifier Flamethrower that ignores fire immunity and shreds armour. Non-Turn Ending"
LocLongDescription="An Superior Purifier Flamethrower that ignores fire immunity and shreds armour. Non-Turn Ending"
LocPromotionPopupText="<Bullet/> An Superior Purifier Flamethrower that ignores fire immunity and shreds armour. Non-Turn Ending"

[PRPA_AdventPurifierIcethrower X2AbilityTemplate]
LocFriendlyName="Advent Purifier Icethrower"
LocHelpText="Advent Purifier Icethrower"
LocLongDescription="Advent Purifier Icethrower"
LocPromotionPopupText="<Bullet/>Advent Purifier Icethrower"

[PRPA_AdvancedPurifierIcethrower X2AbilityTemplate]
LocFriendlyName="Advanced Purifier Icethrower"
LocHelpText="An Advanced Purifier Icethrower"
LocLongDescription="An Advanced Purifier Icethrower"
LocPromotionPopupText="<Bullet/> An Advanced Purifier Icethrower."

[PRPA_SuperiorPurifierIcethrower X2AbilityTemplate]
LocFriendlyName="Superior Purifier Icethrower"
LocHelpText="An Superior Purifier Icethrower. Non-Turn Ending"
LocLongDescription="An Superior Purifier Icethrower. Non-Turn Ending"
LocPromotionPopupText="<Bullet/> An Superior Purifier Icethrower. Non-Turn Ending"

[PRPA_PurifierImmunities X2AbilityTemplate]
LocFriendlyName="Purifier Immunities"
LocHelpText="Grants Immunity to Fire and Poison."
LocLongDescription="Grants Immunity to Fire and Poison."
LocPromotionPopupText="<Bullet/> Grants Immunity to Fire and Poison."

[PRPA_BurningRetreat X2AbilityTemplate]
LocFriendlyName="Burning Retreat"
LocHelpText="Gain a movement only action after using the Purifier Flamethrower."
LocLongDescription="Gain a movement only action after using the Purifier Flamethrower."
LocPromotionPopupText="<Bullet/> Gain a movement only action after using the Purifier Flamethrower."

[PRPA_DeployablePhaseDrone X2AbilityTemplate]
LocFriendlyName="Deployable Phase Drone"
LocHelpText="Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."
LocLongDescription="Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."
LocPromotionPopupText="<Bullet/> Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."

[PRPA_DeployablePhaseDroneSecond X2AbilityTemplate]
LocFriendlyName="Phase Drone Master"
LocHelpText="Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."
LocLongDescription="Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."
LocPromotionPopupText="<Bullet/> Deployable Phase Drone"

[PRPA_DeployablePhaseDroneThird X2AbilityTemplate]
LocFriendlyName="Phase Drone Collector"
LocHelpText="Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."
LocLongDescription="Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."
LocPromotionPopupText="<Bullet/> Grants 1 Deployable Phase Drone that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Phase Drone."

[PRPA_DeployableFrostDroid X2AbilityTemplate]
LocFriendlyName="Deployable Frost Droid"
LocHelpText="Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."
LocLongDescription="Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."
LocPromotionPopupText="<Bullet/> Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."

[PRPA_DeployableFrostDroidSecond X2AbilityTemplate]
LocFriendlyName="Frost Droid Master"
LocHelpText="Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."
LocLongDescription="Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."
LocPromotionPopupText="<Bullet/> Deployable Frost Droid"

[PRPA_DeployableFrostDroidThird X2AbilityTemplate]
LocFriendlyName="Frost Droid Collector"
LocHelpText="Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."
LocLongDescription="Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."
LocPromotionPopupText="<Bullet/> Grants 1 Deployable Frost Droid that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Droid."

[PRPA_DeployableFrostMec X2AbilityTemplate]
LocFriendlyName="Deployable Frost Mec"
LocHelpText="Grants 1 Deployable Frost Mec that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Mec."
LocLongDescription="Grants 1 Deployable Frost Mec that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Mec."
LocPromotionPopupText="<Bullet/> Grants 1 Deployable Frost Mec that gets stronger with secondary weapon tier. Stacks with other sources of Deployable Frost Mec."

[PRPA_Soulfrost X2AbilityTemplate]
LocFriendlyName="Soul Frost"
LocHelpText="Deals guaranteed frost damage and chills the target. Deals bonus damage based on the chill tier of the enemy."
LocLongDescription="Deals guaranteed frost damage and chills the target. Deals bonus damage based on the chill tier of the enemy."
LocPromotionPopupText="<Bullet/> Deals guaranteed frost damage and chills the target. Deals bonus damage based on the chill tier of the enemy."

[PRPA_FrostMania X2AbilityTemplate]
LocFriendlyName="Frost Mania"
LocHelpText="Deals guaranteed frost damage and chills enemies that move or attack within 2 tiles of you. Deals bonus damage based on the chill tier of the enemy."
LocLongDescription="Deals guaranteed frost damage and chills enemies that move or attack within 2 tiles of you. Deals bonus damage based on the chill tier of the enemy."
LocPromotionPopupText="<Bullet/> Deals guaranteed frost damage and chills enemies that move or attack within 2 tiles of you. Deals bonus damage based on the chill tier of the enemy."

[PRPA_Terrorize X2AbilityTemplate]
LocFriendlyName="Terrorize"
LocHelpText="Infilitrate an enemies mind and attempt to inflict visions of terror. If succesful the target will panic. 2 Turn Cooldown."
LocLongDescription="Infilitrate an enemies mind and attempt to inflict visions of terror. If succesful the target will panic. 2 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Infilitrate an enemies mind and attempt to inflict visions of terror. If succesful the target will panic. 2 Turn Cooldown."

[PRPA_NightmareDevour X2AbilityTemplate]
LocFriendlyName="Nightmare Devour"
LocHelpText="Devour the mind of a panicking enemy dealing massive psionic damage. 2 Turn Cooldown."
LocLongDescription="Devour the mind of a panicking enemy dealing massive psionic damage. 2 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Devour the mind of a panicking enemy dealing massive psionic damage. 2 Turn Cooldown."

[PRPA_SpreadingNightmare X2AbilityTemplate]
LocFriendlyName="Spreading Nightmare"
LocHelpText="Devour the mind of a panicking enemy dealing psionic damage and spreading panic to nearby enemies. 4 Turn Cooldown."
LocLongDescription="Devour the mind of a panicking enemy dealing psionic damage and spreading panic to nearby enemies. 4 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Devour the mind of a panicking enemy dealing psionic damage and spreading panic to nearby enemies. 4 Turn Cooldown."

[PRPA_MindControl X2AbilityTemplate]
LocFriendlyName="Mind Control"
LocHelpText="Attempt to Mind Control an enemy. X Turn Cooldown."
LocLongDescription="Attempt to Mind Control an enemy. X Turn Cooldown."
LocPromotionPopupText="<Bullet/> Attempt to Mind Control an enemy. X Turn Cooldown."

[PRPA_VoidBurial X2AbilityTemplate]
LocFriendlyName="Void Burial"
LocHelpText="Pistol Kills generate focus."
LocLongDescription="Pistol Kills generate focus."
LocPromotionPopupText="<Bullet/> Pistol Kills generate focus."

[PRPA_Unleash X2AbilityTemplate]
LocFriendlyName="Unleash"
LocHelpText="Unleash - Focus Cost Fanfire. Does not Trigger Void Burial"
LocLongDescription="Unleash - Focus Cost Fanfire. Does not Trigger Void Burial"
LocPromotionPopupText="<Bullet/> Unleash - Focus Cost Fanfire. Does not Trigger Void Burial"

[PRPA_WraithsWrath X2AbilityTemplate]
LocFriendlyName="Wraiths Wrath"
LocHelpText="Wraiths Wrath - Focus Cost Faceoff. Does not Trigger Void Burial"
LocLongDescription="Wraiths Wrath - Focus Cost Faceoff. Does not Trigger Void Burial"
LocPromotionPopupText="<Bullet/> Wraiths Wrath - Focus Cost Faceoff. Does not Trigger Void Burial"

[PRPA_VoidSlash X2AbilityTemplate]
LocFriendlyName="Void Slash"
LocHelpText="Slash through the void hitting a target with your gauntlet from range. Guaranteed to hit and critically strike. Costs 1 Focus."
LocLongDescription="Slash through the void hitting a target with your gauntlet from range. Guaranteed to hit and critically strike. Costs 1 Focus."
LocPromotionPopupText="<Bullet/> Slash through the void hitting a target with your gauntlet from range. Guaranteed to hit and critically strike. Costs 1 Focus."

[PRPA_BioRocket X2AbilityTemplate]
LocFriendlyName="BioRocket"
LocHelpText="BioRocket"
LocLongDescription="BioRocket"
LocPromotionPopupText="<Bullet/> BioRocket"

[PRPA_AcidSpray X2AbilityTemplate]
LocFriendlyName="AcidSpray"
LocHelpText="AcidSpray"
LocLongDescription="AcidSpray"
LocPromotionPopupText="<Bullet/> AcidSpray"

[PRPA_EnergyShieldMk1 X2AbilityTemplate]
LocFriendlyName="Energy Shield"
LocHelpText="Grants 3 Ablative to you and nearby allies. 8 Turn Cooldown."
LocLongDescription="Grants 3 Ablative to you and nearby allies. 8 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Grants 3 Ablative to you and nearby allies. 8 Turn Cooldown."

[PRPA_EnergyShieldMk2 X2AbilityTemplate]
LocFriendlyName="Advanced Energy Shield"
LocHelpText="Grants 5 Ablative to you and nearby allies. 8 Turn Cooldown."
LocLongDescription="Grants 5 Ablative to you and nearby allies. 8 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Grants 5 Ablative to you and nearby allies. 8 Turn Cooldown."

[PRPA_EnergyShieldMk3 X2AbilityTemplate]
LocFriendlyName="Superior Energy Shield"
LocHelpText="Grants 7 Ablative to you and nearby allies. 8 Turn Cooldown."
LocLongDescription="Grants 7 Ablative to you and nearby allies. 8 Turn Cooldown."
LocPromotionPopupText="<Bullet/> Grants 7 Ablative to you and nearby allies. 8 Turn Cooldown."

[PRPA_TisButAScratch X2AbilityTemplate]
LocFriendlyName="Tis But A Scratch"
LocHelpText="Tis But A Scratch - Reduces Wound Timers by 4 HP."
LocLongDescription="Tis But A Scratch - Reduces Wound Timers by 4 HP."
LocPromotionPopupText="<Bullet/> Tis But A Scratch - Reduces Wound Timers by 4 HP."

[PRPA_GetDown X2AbilityTemplate]
LocFriendlyName="Get Down"
LocHelpText="A Non-Turn Ending pseudo command that grants a Hunker Down Action to an ally."
LocLongDescription="A Non-Turn Ending pseudo command that grants a Hunker Down Action to an ally."
LocPromotionPopupText="<Bullet/> A Non-Turn Ending pseudo command that grants a Hunker Down Action to an ally."

[PRPA_KeepYourHeadDown X2AbilityTemplate]
LocFriendlyName="Keep Your Head Down"
LocHelpText="A Non-Turn Ending pseudo command that causes the first enemy attack against the targeted ally to miss."
LocLongDescription="A Non-Turn Ending pseudo command that causes the first enemy attack against the targeted ally to miss."
LocPromotionPopupText="<Bullet/> A Non-Turn Ending pseudo command that causes the first enemy attack against the targeted ally to miss."

[PRPA_FrostShield X2AbilityTemplate]
LocFriendlyName="Frost Shield"
LocHelpText="Frost Shield grants 1/2/3 Ablative based on armour tier"
LocLongDescription="Frost Shield grants 1/2/3 Ablative based on armour tier"
LocPromotionPopupText="<Bullet/> Frost Shield grants 1/2/3 Ablative based on armour tier"

[PRPA_DefensiveManeuvers X2AbilityTemplate]
LocFriendlyName="DefensiveManeuvers"
LocHelpText="Grants 10 Defense and 10 Dodge to allies within 7 tiles."
LocLongDescription="Grants 10 Defense and 10 Dodge to allies within 7 tiles."
LocPromotionPopupText="<Bullet/> Grants 10 Defense and 10 Dodge to allies within 7 tiles."

[PR_MasterEngineer X2AbilityTemplate]
LocFriendlyName="Master Engineer"
LocHelpText="Once Per Turn, Improvise Grenade Perks will refund the action used."
LocLongDescription="Once Per Turn, Improvise Grenade Perks will refund the action used."
LocPromotionPopupText="<Bullet/> Once Per Turn, Improvise Grenade Perks will refund the action used."

[PR_BitterfrostAirDrop X2AbilityTemplate]
LocFriendlyName="Bitterfrost Air Drop"
LocHelpText="Bitterfrost Air Drop"
LocLongDescription="Bitterfrost Air Drop"
LocPromotionPopupText="<Bullet/> Bitterfrost Air Drop"

[PR_BitterfrostProtocol X2AbilityTemplate]
LocFriendlyName="Bitterfrost Protocol"
LocHelpText="Bitterfrost Protocol"
LocLongDescription="Bitterfrost Protocol"
LocPromotionPopupText="<Bullet/> Bitterfrost Protocol"

[PR_BlackIceProtocol X2AbilityTemplate]
LocFriendlyName="Black Ice Protocol"
LocHelpText="Black Ice Protocol"
LocLongDescription="Black Ice Protocol"
LocPromotionPopupText="<Bullet/> Black Ice Protocol"

[PR_FrostBlossomProtocol X2AbilityTemplate]
LocFriendlyName="Frost Blossom Protocol"
LocHelpText="Black Ice Protocol"
LocLongDescription="Black Ice Protocol"
LocPromotionPopupText="<Bullet/> Black Ice Protocol"

[PR_FreezeProtocol X2AbilityTemplate]
LocFriendlyName="Freeze Protocol"
LocHelpText="Black Ice Protocol"
LocLongDescription="Black Ice Protocol"
LocPromotionPopupText="<Bullet/> Black Ice Protocol"

[PR_HighGround X2AbilityTemplate]
LocFriendlyName="High Ground"
LocHelpText="Grants the Squadsight and Damn Good Ground perks."
LocLongDescription="Grants the Squadsight and Damn Good Ground perks."
LocPromotionPopupText="<Bullet/> Grants the Squadsight and Damn Good Ground perks."

[PRFreeBitterfrostGrenade X2AbilityTemplate]
LocFriendlyName="Free Bitterfrost Grenade"
LocHelpText="Free Bitterfrost Grenade"
LocLongDescription="Free Bitterfrost Grenade"
LocPromotionPopupText="<Bullet/> Free Bitterfrost Grenade"

[PRFreeBitterfrostGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Bitterfrost Grenade"
LocHelpText="Additional Free Bitterfrost Grenade"
LocLongDescription="Additional Free Bitterfrost Grenade"
LocPromotionPopupText="<Bullet/> Additional Free Bitterfrost Grenade"

[ImprovisePRFreeBitterfrostGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Bitterfrost Grenade"
LocHelpText="Improvise Bitterfrost Grenade. 3 Turn Cooldown"
LocLongDescription="Improvise Bitterfrost Grenade. 3 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise Bitterfrost Grenade. 3 Turn Cooldown"

[PRFreeSmokeGrenade X2AbilityTemplate]
LocFriendlyName="Free Smoke Grenade"
LocHelpText="Free Smoke Grenade. Upgrades to Smoke Bomb once researched."
LocLongDescription="Free Smoke Grenadee. Upgrades to Smoke Bomb once researched."
LocPromotionPopupText="<Bullet/> Free Smoke Grenadee. Upgrades to Smoke Bomb once researched."

[PRFreeSmokeGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Smoke Grenade"
LocHelpText="Additional Free Smoke Grenadee. Upgrades to Smoke Bomb once researched."
LocLongDescription="Additional Free Smoke Grenadee. Upgrades to Smoke Bomb once researched."
LocPromotionPopupText="<Bullet/> Additional Free Smoke Grenadee. Upgrades to Smoke Bomb once researched."

[ImprovisePRFreeSmokeGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Smoke Grenade"
LocHelpText="Improvise Smoke Grenade. 2 Turn Cooldowne. Upgrades to Smoke Bomb once researched."
LocLongDescription="Improvise Smoke Grenade. 2 Turn Cooldowne. Upgrades to Smoke Bomb once researched."
LocPromotionPopupText="<Bullet/> Improvise Smoke Grenade. 2 Turn Cooldowne. Upgrades to Smoke Bomb once researched."

[PRFreeFragGrenade X2AbilityTemplate]
LocFriendlyName="Free Frag Grenade"
LocHelpText="Free Frag Grenade. Upgrades to Plasma Grenade once researched."
LocLongDescription="Free Frag Grenade. Upgrades to Plasma Grenade ocne researched."
LocPromotionPopupText="<Bullet/> Free Frag Grenade. Upgrades to Plasma Grenade ocne researched."

[PRFreeFragGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Frag Grenade"
LocHelpText="Additional Free Frag Grenade. Upgrades to Plasma Grenade once researched."
LocLongDescription="Additional Free Frag Grenade. Upgrades to Plasma Grenade ocne researched."
LocPromotionPopupText="<Bullet/> Additional Free Frag Grenade. Upgrades to Plasma Grenade ocne researched."

[ImprovisePRFreeFragGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Frag Grenade"
LocHelpText="Improvise Frag Grenade. 3 Turn Cooldown. Upgrades to Plasma Grenade once researched."
LocLongDescription="Improvise Frag Grenade. 3 Turn Cooldown. Upgrades to Plasma Grenade ocne researched."
LocPromotionPopupText="<Bullet/> Improvise Frag Grenade. 3 Turn Cooldown. Upgrades to Plasma Grenade ocne researched."

[PRFreeAcidGrenade X2AbilityTemplate]
LocFriendlyName="Free Acid Grenade"
LocHelpText="Free Acid Grenade. Upgrades to Acid Bomb once reasearched."
LocLongDescription="Free Acid Grenade. Upgrades to Acid Bomb once reasearched."
LocPromotionPopupText="<Bullet/> Free Acid Grenade. Upgrades to Acid Bomb once reasearched."

[PRFreeAcidGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Acid Grenade"
LocHelpText="Additional Free Acid Grenade. Upgrades to Acid Bomb once reasearched."
LocLongDescription="Additional Free Acid Grenade. Upgrades to Acid Bomb once reasearched."
LocPromotionPopupText="<Bullet/> Additional Free Acid Grenade. Upgrades to Acid Bomb once reasearched."

[ImprovisePRFreeAcidGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Acid Grenade"
LocHelpText="Improvise Acid Grenade. 4 Turn Cooldown. Upgrades to Acid Bomb once reasearched."
LocLongDescription="Improvise Acid Grenade. 4 Turn Cooldown. Upgrades to Acid Bomb once reasearched."
LocPromotionPopupText="<Bullet/> Improvise Acid Grenade. 4 Turn Cooldown. Upgrades to Acid Bomb once reasearched."

[PRFreeEMPGrenade X2AbilityTemplate]
LocFriendlyName="Free EMP Grenade"
LocHelpText="Free EMP Grenade"
LocLongDescription="Free EMP Grenade"
LocPromotionPopupText="<Bullet/> Free EMP Grenade"

[PRFreeEMPGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free EMP Grenade"
LocHelpText="Additional Free EMP Grenade"
LocLongDescription="Additional Free EMP Grenade"
LocPromotionPopupText="<Bullet/> Additional Free EMP Grenade"

[ImprovisePRFreeEMPGrenade X2AbilityTemplate]
LocFriendlyName="Improvise EMP Grenade"
LocHelpText="Improvise EMP Grenade. 3 Turn Cooldown"
LocLongDescription="Improvise EMP Grenade. 3 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise EMP Grenade. 3 Turn Cooldown"

[PRFreeFirebomb X2AbilityTemplate]
LocFriendlyName="Free Incendiary Grenade"
LocHelpText="Free Incendiary Grenade. Upgrades to Incendiary Bomb once researched."
LocLongDescription="Free Incendiary Grenade. Upgrades to Incendiary Bomb once researched."
LocPromotionPopupText="<Bullet/> Free Incendiary Grenade. Upgrades to Incendiary Bomb once researched."

[PRFreeFirebomb2 X2AbilityTemplate]
LocFriendlyName="Additional Free Incendiary Grenade"
LocHelpText="Additional Free Incendiary Grenade. Upgrades to Incendiary Bomb once researched."
LocLongDescription="Additional Free Incendiary Grenade. Upgrades to Incendiary Bomb once researched."
LocPromotionPopupText="<Bullet/>Additional Free Incendiary Grenade. Upgrades to Incendiary Bomb once researched."

[ImprovisePRFreeFirebomb X2AbilityTemplate]
LocFriendlyName="Improvise Incendiary Grenade"
LocHelpText="Improvise Incendiary Grenade. 5 Turn Cooldown. Upgrades to Incendiary Bomb once researched."
LocLongDescription="Improvise Incendiary Grenade. 5 Turn Cooldown. Upgrades to Incendiary Bomb once researched."
LocPromotionPopupText="<Bullet/> Improvise Incendiary Grenade. 5 Turn Cooldown. Upgrades to Incendiary Bomb once researched."

[PRFreeNeurotoxinGrenade X2AbilityTemplate]
LocFriendlyName="Free Neurotoxin Grenade"
LocHelpText="Free Neurotoxin Grenade"
LocLongDescription="Free Neurotoxin Grenade"
LocPromotionPopupText="<Bullet/>Free Neurotoxin Grenade"

[PRFreeNeurotoxin2Grenade X2AbilityTemplate]
LocFriendlyName="Additional Free Neurotoxin Grenade"
LocHelpText="Additional Free Neurotoxin Grenade"
LocLongDescription="Additional Free Neurotoxin Grenade"
LocPromotionPopupText="<Bullet/> Additional Free Neurotoxin Grenade"

[ImprovisePRFreeNeurotoxinGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Neurotoxin Grenade"
LocHelpText="Improvise Neurotoxin Grenade. 3 Turn Cooldown"
LocLongDescription="Improvise Neurotoxin Grenade. 3 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise Neurotoxin Grenade. 3 Turn Cooldown"

[PRFreeGasGrenade X2AbilityTemplate]
LocFriendlyName="Free Gas Grenade"
LocHelpText="Free Gas Grenade. Upgrades to Gas Bomb once researched."
LocLongDescription="Free Gas Grenade. Upgrades to Gas Bomb once researched."
LocPromotionPopupText="<Bullet/> Free Gas Grenade. Upgrades to Gas Bomb once researched."

[PRFreeGasGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Gas Grenade"
LocHelpText="Additional Free Gas Grenade. Upgrades to Gas Bomb once researched."
LocLongDescription="Additional Free Gas Grenade. Upgrades to Gas Bomb once researched."
LocPromotionPopupText="<Bullet/>Additional Free Gas Grenade. Upgrades to Gas Bomb once researched."

[ImprovisePRFreeGasGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Gas Grenade"
LocHelpText="Improvise Gas Grenade. 4 Turn Cooldown. Upgrades to Gas Bomb once researched."
LocLongDescription="Improvise Gas Grenade. 4 Turn Cooldown. Upgrades to Gas Bomb once researched."
LocPromotionPopupText="<Bullet/> Improvise Gas Grenade. 4 Turn Cooldown. Upgrades to Gas Bomb once researched."

[PRFreeFlashbangGrenade X2AbilityTemplate]
LocFriendlyName="Free Flashbang Grenade"
LocHelpText="Free Flashbang Grenade"
LocLongDescription="Free Flashbang Grenade"
LocPromotionPopupText="<Bullet/> Free Flashbang Grenade"

[PRFreeFlashbangGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Flashbang Grenade"
LocHelpText="Additional Free Flashbang Grenade"
LocLongDescription="Additional Free Flashbang Grenade"
LocPromotionPopupText="<Bullet/> Additional Free Flashbang Grenade"

[ImprovisePRFreeFlashbangGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Flashbang Grenade"
LocHelpText="Improvise Flashbang Grenade. 2 Turn Cooldown"
LocLongDescription="Improvise Flashbang Grenade. 2 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise Flashbang Grenade. 2 Turn Cooldown"

[PRFreeRadGrenade X2AbilityTemplate]
LocFriendlyName="Free Radiation Grenade"
LocHelpText="Free Radiation Grenade"
LocLongDescription="Free Radiation Grenade"
LocPromotionPopupText="<Bullet/> Free Radiation Grenade"

[PRFreeRadGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Radiation Grenade"
LocHelpText="Additional Free Radiation Grenade"
LocLongDescription="Additional Free Radiation Grenade"
LocPromotionPopupText="<Bullet/> Additional Free Radiation Grenade"

[ImprovisePRFreeRadGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Radiation Grenade"
LocHelpText="Improvise Radiation Grenade. 8 Turn Cooldown"
LocLongDescription="Improvise Radiation Grenade. 8 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise Radiation Grenade. 8 Turn Cooldown"

[PRFreeMagGrenade X2AbilityTemplate]
LocFriendlyName="Free Magnetic Grenade"
LocHelpText="Free Magnetic Grenade"
LocLongDescription="Free Magnetic Grenade"
LocPromotionPopupText="<Bullet/> Free Magnetic Grenade"

[PRFreeMagGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Magnetic Grenade"
LocHelpText="Additional Free Magnetic Grenade"
LocLongDescription="Additional Free Magnetic Grenade"
LocPromotionPopupText="<Bullet/> Additional Free Magnetic Grenade"

[ImprovisePRFreeMagGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Magnetic Grenade"
LocHelpText="Improvise Magnetic Grenade. 4 Turn Cooldown"
LocLongDescription="Improvise Magnetic Grenade. 4 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise Magnetic Grenade. 4 Turn Cooldown"

[PRFreeLaserGrenade X2AbilityTemplate]
LocFriendlyName="Free Laser Grenade"
LocHelpText="Free Laser Grenade"
LocLongDescription="Free Laser Grenade"
LocPromotionPopupText="<Bullet/> Free Laser Grenade"

[PRFreeLaserGrenade2 X2AbilityTemplate]
LocFriendlyName="Additional Free Laser Grenade"
LocHelpText="Additional Free Laser Grenade"
LocLongDescription="Additional Free Laser Grenade"
LocPromotionPopupText="<Bullet/> Additional Free Laser Grenade"

[ImprovisePRFreeLaserGrenade X2AbilityTemplate]
LocFriendlyName="Improvise Laser Grenade"
LocHelpText="Improvise a Laser Grenade. 6 Turn Cooldown"
LocLongDescription="Improvise a Laser Grenade. 6 Turn Cooldown"
LocPromotionPopupText="<Bullet/> Improvise a Laser Grenade. 6 Turn Cooldown"
